const yup = require('yup');


const userValidationSchema = yup.object().shape({
    fullName: yup.string("نام کامل باید بصورت استرینگ باشد").required("وارد کردن نام کامل الزامی میباشد").min(4, "نام کامل حداقل باید دارای 4 کاراکتر باشد").max(255, "نام کامل حداکثر باید دارای 255 کاراکتر باشد"),
    email: yup.string("ایمیل باید بصورت استرینگ باشد").required("وارد کردن ایمیل الزامی میباشد").email("فرمت ایمیل باید صحیح باشد"),
    password: yup.string("رمز عبور باید بصورت استرینگ باشد").required("وارد کردن رمز عبور الزامی میباشد").min(5, "کلمه عبور حداقل باید دارای 5 کاراکتر باشد").max(50, "کلمه عبور حداکثر باید دارای 50 کاراکتر باشد"),
    confirmPassword: yup.string("تکرار رمز عبور باید بصورت استرینگ باشد").required("وارد کردن تکرار رمز عبور الزامی میباشد").min(5, "تکرار کلمه عبور حداقل باید دارای 5 کاراکتر باشد").max(50, "کلتکرار مه عبور حداکثر باید دارای 50 کاراکتر باشد").oneOf([yup.ref("password"), null], "تکرار کلمه عبور با کلمه عبور یکسان نیست")
})

module.exports = {
    userValidationSchema
}